---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCImportOptions.#ctor
source: html/303d5cc5-8885-e5ad-fd84-304abda7ee5b.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.#ctor Method

Constructs a new IFCImportOptions using default settings.

## Syntax (C#)
```csharp
public IFCImportOptions()
```